TexasInstruments/f29h85x-sdk/examples/driverlib/single_core/flash/F29H85x_EEPROM_PingPong/F29H85x_EEPROM_PingPong.c
    return Warning_Flags;
}

void EEPROM_Erase_All()
{
    //
    // Compute the protection masks for all sectors used in emulation
    //
    uint64_t WE_Protection_AB_Sectors_Unit_0 = Configure_Protection_Masks(FIRST_AND_LAST_SECTOR[0], NUM_EEPROM_SECTORS);
    uint64_t WE_Protection_AB_Sectors_Unit_1 = Configure_Protection_Masks(FIRST_AND_LAST_SECTOR[1], NUM_EEPROM_SECTORS);
    uint32_t Combined_WE_Protection_A_Sectors = (uint32_t)WE_Protection_AB_Sectors_Unit_0 | (uint32_t)WE_Protection_AB_Sectors_Unit_1;
    uint32_t Combined_WE_Protection_B_Sectors = WE_Protection_AB_Sectors_Unit_0 >> 32 | WE_Protection_AB_Sectors_Unit_1 >> 32;
    WE_Protection_A_Mask = 0xFFFFFFFF ^ Combined_WE_Protection_A_Sectors;
    WE_Protection_B_Mask = 0x00000FFF ^ Combined_WE_Protection_B_Sectors;

    //
    // Erase both units
    //
    Erase_Bank();

    //
    // Set the protection masks for only our active unit
    //
    Set_Protection_Masks();

    //
    // Reset the bank and page pointers to the start of the
    // active unit
    //
    RESET_BANK_POINTER;
    RESET_PAGE_POINTER;

}

uint64_t Configure_Protection_Masks(uint32_t* Sector_Numbers, uint32_t Num_EEPROM_Sectors)
{
    uint64_t Protection_Mask_Sectors = 0;

    //
    // If we are using more than one sector
    //
    if (Num_EEPROM_Sectors > 1)
    {
        uint64_t Unshifted_Sectors;
        uint8_t Shift_Amount;

        //
        // If all sectors use Mask A
        //
        if (Sector_Numbers[0] < 32 && Sector_Numbers[1] < 32)
        {
            //
            // Shift 1 out to 1 bit past the number of sectors
            //
            Unshifted_Sectors = (uint64_t) 1 << Num_EEPROM_Sectors;

            //
            // Subtract 1 --> now we have all 1s for the number of sectors we want
            //
            Unshifted_Sectors -= 1;

            //
            // Shift over by start location and OR with master
            //
            Protection_Mask_Sectors |= (Unshifted_Sectors << Sector_Numbers[0]);
        }
        //
        // If all sectors use Mask B
        //
        else if (Sector_Numbers[0] > 31 && Sector_Numbers[1] > 31)
        {
            //
            // Subtract 32 because these use a different mask, rebase to 0
            // We divide by 8 because each bit here protects 8 sectors
            //
            Shift_Amount = ((Sector_Numbers[1] - 32) / 8) - ((Sector_Numbers[0] - 32) / 8) + 1;
           
            //
            // Then perform the same operations as for mask A
            //
            Unshifted_Sectors = (uint64_t) 1 << Shift_Amount;
            Unshifted_Sectors -= 1;
            Protection_Mask_Sectors |= (Unshifted_Sectors << ((Sector_Numbers[0] - 32)/8));
            Protection_Mask_Sectors = Protection_Mask_Sectors << 32;
        }
        //
        // If a mix of masks A and B
        //
        else
        {
            //
            // Configure mask B first, in the same manner as above
            //
            Shift_Amount = ((Sector_Numbers[1] - 32)/8) + 1;
            Unshifted_Sectors = (uint64_t) 1 << Shift_Amount;
            Unshifted_Sectors -= 1;
            Protection_Mask_Sectors |= Unshifted_Sectors;

            //
            // Zero out the bottom half so we can configure Mask A
            //
            Protection_Mask_Sectors = Protection_Mask_Sectors << 32;

            //
            // Configure Mask A and OR into main mask
            //
            Unshifted_Sectors = (uint64_t) 1 << ((32 - Sector_Numbers[0]) + 1);
            Unshifted_Sectors -= 1;
            Protection_Mask_Sectors |= (Unshifted_Sectors << Sector_Numbers[0]);
        }
    }
    //
    // If using only 1 sector
    //
    else
    {
        //
        // Mask A
        //
        if(Sector_Numbers[0] < 32)
        {
            //
            // Shift the bit over to the corresponding sector, then OR it in
            //
            Protection_Mask_Sectors |= ((uint64_t) 1 << Sector_Numbers[0]);
        }
        //
        // Mask B
        //
        else
        {
            //
            // Shift the bit over to the corresponding sector, then OR it in
            // Subtraction and division are to account for the rebase and number of sectors protected by each bit
            // See above comments for more detail
            //
            Protection_Mask_Sectors |= ((uint64_t) 1 << ((Sector_Numbers[0] - 32)/8));
            Protection_Mask_Sectors = Protection_Mask_Sectors << 32;
        }
    }

    return Protection_Mask_Sectors;
}

void ClearFSMStatus(void)
{
    Fapi_FlashStatusType  oFlashStatus;
    Fapi_StatusType  oReturnCheck;

    //
    // Wait for FSM to finish previous operation
    //
    while (Fapi_checkFsmForReady(FLASH_BANK_SELECT, u32UserFlashConfig) != Fapi_Status_FsmReady);

    oFlashStatus = Fapi_getFsmStatus(FLASH_BANK_SELECT, u32UserFlashConfig);

    if (oFlashStatus != 0) {
        //
        // Clear the status register
        //
        oReturnCheck = Fapi_issueAsyncCommand(FLASH_BANK_SELECT, u32UserFlashConfig, Fapi_ClearStatus);
        
        //
        // Wait for the status to clear
        //
        while (Fapi_getFsmStatus(FLASH_BANK_SELECT, u32UserFlashConfig) != 0);

        if (oReturnCheck != Fapi_Status_Success)
        {
            Sample_Error();
        }
    }
}


void EEPROM_GetValidBank(uint8_t ReadFlag)
{
    // 
    // Start search from the beginning of the active bank's flash sectors
    //
    RESET_BANK_POINTER;
    RESET_PAGE_POINTER;

    uint8_t i;
    for (i = 0; i < NUM_EEPROM_BANKS; i++)
    {
        //
        // Check the first status byte to see if bank is in use or full
        //
        uint8_t Bank_in_Use = *(Bank_Pointer);
        uint8_t Bank_Full = *(Bank_Pointer + WRITE_SIZE_BYTES);

        // 
        // If we have found an unused (empty) bank,
        // then update the bank counter
        //
        if (Bank_in_Use == EMPTY_BANK)
        {
            Bank_Counter = i;
            // Page_Pointer will be set in EEPROM_UpdateBankStatus()
            return;
        }

        //
        // If we have found a used bank with blank pages
        //
        if (Bank_in_Use == CURRENT_BANK && Bank_Full != CURRENT_BANK)
        {
            //
            // Update the bank counter
            // 
            Bank_Counter = i;

            //
            // Set the page pointer to the start of the bank.
            // It will be adjusted to the open page in the loop after this
            //
            Page_Pointer = Bank_Pointer + WRITE_SIZE_BYTES*2; // skip over the bank status
            break;
        }

        //
        // If the current bank is full
        //
        if (Bank_in_Use == CURRENT_BANK && Bank_Full == CURRENT_BANK)
        {
            //
            // Move to the next bank and continue the loop
            //
            Bank_Pointer += Bank_Size;
        }
    }

    //
    // Find the current page
    //
    for (i = 0; i < NUM_EEPROM_PAGES; i++)
    {
        //
        // Check the status fields to see if page is in use or full
        //
        uint8_t Page_in_Use = *(Page_Pointer);
        uint8_t Page_Full = *(Page_Pointer + WRITE_SIZE_BYTES);

        //
        // If we've found a blank page, we can break out
        //
        if (Page_in_Use == BLANK_PAGE)
        {
            Page_Counter = i;
            break;
        }

        //
        // If we have found the current page in use, set the page counter
        // to the current number of pages in use for this EEPROM bank
        // and break the loop
        //
        if (Page_in_Use == CURRENT_PAGE && Page_Full != CURRENT_PAGE)
        {
            Page_Counter = i + 1;
            break;
        }

        //
        // Go to the next page
        //
        Page_Pointer += WRITE_SIZE_BYTES*2 + EEPROM_PAGE_DATA_SIZE;
    }

    //
    // If we've filled all banks and pages, swap EEPROM units
    // and erase the old one
    //
    if (!ReadFlag && Bank_Counter == NUM_EEPROM_BANKS - 1 && Page_Counter == NUM_EEPROM_PAGES)
    {
        //
        // Mark page as used for completeness
        //
        EEPROM_UpdatePageStatus();

        //
        // Mark bank as used for completeness
        //
        EEPROM_UpdateBankStatus();

        //
        // Swap the active EEPROM unit and flag the old one for
        // erasure after the next write finishes
        EEPROM_ACTIVE_UNIT ^= 1;
        Set_Protection_Masks();
        Erase_Inactive_Unit = 1;

        //
        // Move bank pointer to start of new unit
        //
        RESET_BANK_POINTER;
        
        //
        // Move page pointer to start of new unit
        //
        RESET_PAGE_POINTER;
    }
}

void EEPROM_Erase_Inactive_Unit()
{
    //
    // Switch to the inactive unit and set the protection masks
    //
    EEPROM_ACTIVE_UNIT ^= 1;
    Set_Protection_Masks();

    //
    // Erase the inactive unit
    //
    Erase_Bank();

    //
    // Switch back to the active unit and set the protection masks
    //
    EEPROM_ACTIVE_UNIT ^= 1;
    Set_Protection_Masks();
}

