TexasInstruments/f29h85x-sdk/examples/driverlib/single_core/flash/F29H85x_EEPROM_PingPong/F29H85x_EEPROM_PingPong.c
void Erase_Bank()
{
    Fapi_StatusType  oReturnCheck;
    Fapi_FlashStatusType  oFlashStatus;

    //
    // Clear the status of the previous flash operation
    //
    ClearFSMStatus();

    //
    // Enable program/erase protection for select sectors
    //
    Fapi_setupBankSectorEnable((uint32_t*) FLASH_BANK_SELECT, u32UserFlashConfig, FLASH_NOWRAPPER_O_CMDWEPROTA, WE_Protection_A_Mask);
    Fapi_setupBankSectorEnable((uint32_t*) FLASH_BANK_SELECT, u32UserFlashConfig, FLASH_NOWRAPPER_O_CMDWEPROTB, WE_Protection_B_Mask);

    //
    // Erase the flash bank
    //
    oReturnCheck = Fapi_issueBankEraseCommand((uint32_t*) FLASH_BANK_SELECT, 0, u32UserFlashConfig);

    //
    // Wait for completion and check for any programming errors
    //
    while(Fapi_checkFsmForReady((uint32_t) FLASH_BANK_SELECT, u32UserFlashConfig) == Fapi_Status_FsmBusy);

    if (oReturnCheck != Fapi_Status_Success)
        Sample_Error();

    oFlashStatus = Fapi_getFsmStatus((uint32_t) FLASH_BANK_SELECT, u32UserFlashConfig);
    if (oFlashStatus != 3)
    {
        FMSTAT_Fail();
    }

    //
    // If configured to, perform a blank check to ensure proper erasure
    //
    if (Erase_Blank_Check)
    {
        uint32_t address = FLASH_BANK_SELECT + FIRST_AND_LAST_SECTOR[EEPROM_ACTIVE_UNIT][0] * FLASH_SECTOR_SIZE;
        Fapi_FlashStatusWordType oFlashStatusWord;
        oReturnCheck = Fapi_doBlankCheck((uint32_t*) address, BLANK_CHECK_LEN, &oFlashStatusWord, 0, u32UserFlashConfig);

        if (oReturnCheck != Fapi_Status_Success)
        {
            Sample_Error();
        }
    }
}

void EEPROM_Read(uint8_t* Read_Buffer)
{
    //
    // If we haven't written any data yet, don't allow a read
    //
    if (Empty_EEPROM)
    {
        Sample_Error();
    }

#ifdef PAGE_MODE
    //
    // Get the current page data
    //
    EEPROM_GetValidBank(1);

    //
    // Skip over the page status bytes
    //
    Page_Pointer += WRITE_SIZE_BYTES*2;

    uint32_t i;
    for (i = 0; i < DATA_SIZE; i++)
    {
        //
        // Read page data from flash
        //
        Read_Buffer[i] = *(Page_Pointer++);
    }

#else
    //
    // Move pointer back 64 bits to read most recent data
    //
    Bank_Pointer -= WRITE_SIZE_BYTES;
    uint32_t i;
    for (i = 0; i < WRITE_SIZE_BYTES; i++)
    {
        //
        // Read page data from flash
        //
        Read_Buffer[i] = *(Bank_Pointer++);
    }

#endif
}

void EEPROM_Write_Page(uint8_t* Write_Buffer)
{
    //
    // Set pointers to the most recently used page, swapping units and
    // flagging the old for erasure if necessary.
    // If no data has been written yet, this will return a blank page.
    //
    EEPROM_GetValidBank(0);

    //
    // If our new page is in the middle of a bank,
    // mark the previous page as dirty and increment the pointer to a blank one
    //
    EEPROM_UpdatePageStatus();

    //
    // If we switched to a new EEPROM bank, mark it as current.
    // If our EEPROM bank is full, mark it as used and adjust the
    // bank and page pointers
    //
    EEPROM_UpdateBankStatus();
    
    //
    // Write our data to the page, mark it as current, and erase the
    // inactive unit if necessary
    //
    EEPROM_UpdatePageData(Write_Buffer);
}

void EEPROM_Write_Buffer(uint8_t* address, uint8_t* write_buffer)
{
    Fapi_StatusType oReturnCheck;
    Fapi_FlashStatusType  oFlashStatus;
    Fapi_FlashStatusWordType oFlashStatusWord;

    //
    // Clear the status of the previous Flash operation
    //
    ClearFSMStatus();

    //
    // Enable program/erase protection for select sectors
    //
    Fapi_setupBankSectorEnable((uint32_t*) FLASH_BANK_SELECT, u32UserFlashConfig, FLASH_NOWRAPPER_O_CMDWEPROTA, WE_Protection_A_Mask);
    Fapi_setupBankSectorEnable((uint32_t*) FLASH_BANK_SELECT, u32UserFlashConfig, FLASH_NOWRAPPER_O_CMDWEPROTB, WE_Protection_B_Mask);

    //
    // Program data to flash
    //
    oReturnCheck = Fapi_issueProgrammingCommand((uint32_t*) address, (uint8_t*) write_buffer, WRITE_SIZE_BYTES, 0, 0, Fapi_AutoEccGeneration, u32UserFlashConfig);

    //
    //  Wait for completion and check for any programming errors
    //
    while (Fapi_checkFsmForReady((uint32_t) address, u32UserFlashConfig) == Fapi_Status_FsmBusy);

    if (oReturnCheck != Fapi_Status_Success)
    {
        Sample_Error();
    }

    oFlashStatus = Fapi_getFsmStatus((uint32_t) address, u32UserFlashConfig);
    if (oFlashStatus != 3)
    {
        FMSTAT_Fail();
    }

    //
    // Verify the correct data was written
    //
    oReturnCheck = Fapi_doVerify((uint32_t*) address, VERIFY_LEN, (uint32_t*) write_buffer, &oFlashStatusWord, 0, u32UserFlashConfig);
    if (oReturnCheck != Fapi_Status_Success)
    {
        Sample_Error();
    }
}

void EEPROM_UpdateBankStatus()
{
    Fapi_StatusType oReturnCheck;

    uint8_t Current_Bank_Status = *(Bank_Pointer);

    //
    // If the current bank is empty
    //
    if (Current_Bank_Status == EMPTY_BANK)
    {
        //
        // Fill the bank status buffer
        //
        Fill_Buffer(Bank_Status, status_buffer_len, CURRENT_BANK);

        //
        // Write the buffer to the start of the bank status in flash, 
        // marking the bank as current
        //
        EEPROM_Write_Buffer(Bank_Pointer, Bank_Status);

        //
        // Reset the page counter and page pointer
        //
        Page_Counter = 0;
        Page_Pointer = Bank_Pointer + WRITE_SIZE_BYTES*2;
    }

    //
    // If the current bank is full
    //
    else if (Current_Bank_Status == CURRENT_BANK && Page_Counter == NUM_EEPROM_PAGES)
    {
        //
        // Fill the bank status buffer
        //
        Fill_Buffer(Bank_Status, status_buffer_len, CURRENT_BANK);

        //
        // Write the buffer to the end of the bank status in flash, 
        // marking the bank as used/full
        //
        EEPROM_Write_Buffer(Bank_Pointer + WRITE_SIZE_BYTES, Bank_Status);

        //
        // Increment the bank pointer to the next EEPROM bank
        //
        Bank_Pointer += Bank_Size;

        //
        // If all banks and pages have been used, the new bank pointer is invalid.
        // The function returns early and the flash will be erased in EEPROM_GetValidBank()
        // This if statement only applies when this function is called from EEPROM_GetValidBank()
        //
        if (Bank_Counter == NUM_EEPROM_BANKS - 1)
        {
            return;
        }

        //
        // If the pointer is valid, mark the new bank as current and set the page pointer
        //
        Fill_Buffer(Bank_Status, status_buffer_len, CURRENT_BANK);
        EEPROM_Write_Buffer(Bank_Pointer, Bank_Status);
        Page_Counter = 0;
        Page_Pointer = Bank_Pointer + WRITE_SIZE_BYTES*2;
    }
}

void EEPROM_UpdatePageStatus()
{
    Fapi_StatusType oReturnCheck;

    uint8_t Current_Page_Status = *(Page_Pointer);

    //
    // If our current page is blank, we don't need to mark it as used
    //
    if (Current_Page_Status == BLANK_PAGE)
    {
        return;
    }

    //
    // Otherwise, fill the bank status buffer
    //
    Fill_Buffer(Page_Status, status_buffer_len, CURRENT_PAGE);

    //
    // And write it to the end of the page status in flash, 
    // marking the page as used
    //
    EEPROM_Write_Buffer(Page_Pointer + WRITE_SIZE_BYTES, Page_Status);

    //
    // Increment the page pointer to the next page
    //
    Page_Pointer += EEPROM_PAGE_DATA_SIZE + WRITE_SIZE_BYTES*2;
}

